[
    {
        "name": "ANTOINE OSAY CLARK v. COMMONWEALTH OF PENNSYLVANIA DEPARTMENT OF TRANSPORTATION",
        "date": 40795,
        "type": "DUI",
        "judgment": "Plaintiff",
        "ruling": "Licensee's appeal of the operating privilege suspension is sustained; and the suspension is rescinded.",
        "opinion_link": "http://0-www.lexisnexis.com.catalog.library.uarts.edu/hottopics/lnacademic/",
        "attorney_id": 1
    },
    {
        "name": "COMMON WEALTH OF PENNSYLVANIA v.  MICHAEL BARNA",
        "date": 41710,
        "type": "DUI",
        "judgment": "Motion Denied",
        "ruling": "On May 25, 2012, Appellee Michael Barna was arrested and charged with Driving Under the Influence pursuant to 75 Pa.C.S. ยง 3802. On, January 14, 2014, Appellee argued a motion to suppress his drug test results under the Fourth Amendment of United States Constitution and Article I, ยง 8 of the Pennsylvania Constitution. This motion was denied by the Honorable Teresa Carr Deni, Subsequently, after a non-jury trial on March 12, 2014, the Honorable Gerard A. Kosinski found Appellee guilty. On June 23, 2014, Judge Kosinski sentenced Appellee to 90-180 days confinement and 18 months of probation. On July 18, 2014, Appellee filed a Writ of Certiorari to Common Pleas Court, On August 6, 2015, this Court issued an Order granting Appellee's Writ of Certiorari, thereby vacating Appellee's sentence and reversing Appellee's conviction. This Commonwealth appeal followed.",
        "opinion_link": "https://casetext.com/case/commonwealth-v-barna-1",
        "attorney_id": 1
    },
    {
        "name": "CYNTHIA SMITH, Appellee, v. COMMONWEALTH OF PENNSYLVANIA DEPARTMENT OF TRANSPORTATION COMMONWEALTH COURT, Appellant,",
        "date": 41348,
        "type": "DUI",
        "judgment": "Appeal Granted",
        "ruling": "I found Appellee testified credibly regarding what took place. HN2Determinations as to the credibility of witnesses and the weight to be afforded their testimony are within the sole province of the trial court and will not be disturbed on appeal. Postgate v. Department of Transportation, Bureau of Driver Licensing, 781 A.2d 276 (Pa. Cmwlth. 2001), appeal denied, 568 Pa. 689, 796 A.2d 320 (2002). Based on Appellee's testimony, the documents I reviewed and the evidence of the  [*6] short period of time Appellee was given to appreciate the gravity of her situation, I concluded Appellee had not refused to take the test and sustained her appeal.",
        "opinion_link": "http://0-www.lexisnexis.com.catalog.library.uarts.edu/lnacui2api/results/shared/controller/permalink.do",
        "attorney_id": 1
    },
    {
        "name": "SOURCES\n\nhttps://casetext.com"
    }
]